*  RubyPython zsh elisp works
#+begin_src ruby :results output
puts "Hello, World!"
#+end_src

#+RESULTS:
: Hello, World!

#+name: elisp
#+begin_src emacs-lisp
(+ 2 3)
#+end_src

#+RESULTS: elisp
: 5

#+name: basic-python
#+begin_src python :results output
print('hellorld')
#+end_src

#+RESULTS: basic-python
: hellorld

#+name: hello-world-prefix
#+begin_src zsh :exports none
  echo "/--------------------------foo------------------------------\\"
#+end_src

#+RESULTS: hello-world-prefix
: /--------------------------foo------------------------------\

#+begin_src zsh
  echo "This file takes up `du -h ~/python 's/\([0-9k]*\)[ ]*org-babel.org/\1/'`"
#+end_src

#+RESULTS:
| This file takes up 8.0K | /Users/charles.marano/python/project1/.idea/inspectionProfiles |
| 32K                     | /Users/charles.marano/python/project1/.idea                    |
|                         |                                                                ||                                                                                         |


#+begin_src rust
fn main() {
    println!("Hello, world!");
}
#+end_src

#+RESULTS:
: Hello, world!

#+begin_src rust
fn main() {
    let greetings = ["Hello", "Hola", "Bonjour",
                     "Ciao", "こんにちは", "안녕하세요",
                     "Cześć", "Olá", "Здравствуйте",
                     "chào bạn", "您好"];

    for (num, greeting) in greetings.iter().enumerate() {
        print!("{} : ", greeting);
        match num {
            0 =>  println!("This code is editable and runnable!"),
            1 =>  println!("Este código es editable y ejecutable!"),
            2 =>  println!("Ce code est modifiable et exécutable!"),
            3 =>  println!("Questo codice è modificabile ed eseguibile!"),
            4 =>  println!("このコードは編集して実行出来ます！"),
            5 =>  println!("여기에서 코드를 수정하고 실행할 수 있습니다!"),
            6 =>  println!("Ten kod można edytować oraz uruchomić!"),
            7 =>  println!("Esse código é editável e executável!"),
            8 =>  println!("Этот код можно отредактировать и запустить!"),
            9 =>  println!("Bạn có thể edit và run code trực tiếp!"),
            10 =>  println!("这段代码是可以编辑并且能够运行的！"),
            _ =>  {},
        }
    }
}
#+end_src

#+RESULTS:
#+begin_example
Hello : This code is editable and runnable!
Hola : Este código es editable y ejecutable!
Bonjour : Ce code est modifiable et exécutable!
Ciao : Questo codice è modificabile ed eseguibile!
こんにちは : このコードは編集して実行出来ます！
안녕하세요 : 여기에서 코드를 수정하고 실행할 수 있습니다!
Cześć : Ten kod można edytować oraz uruchomić!
Olá : Esse código é editável e executável!
Здравствуйте : Этот код можно отредактировать и запустить!
chào bạn : Bạn có thể edit và run code trực tiếp!
您好 : 这段代码是可以编辑并且能够运行的！
#+end_example


